Revit 2026 API

# ElementArePhasesModifiable Method

---

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ArePhasesModifiable()
```
```vb
Public Function ArePhasesModifiable As Boolean
```
```cpp
public:
bool ArePhasesModifiable()
```
```fsharp
member ArePhasesModifiable : unit -> bool
```

#### Return Value

Boolean True if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element, false otherwise.

Acts as a validator for setting the properties CreatedPhaseId and DemolishedPhaseId.

#### Reference

Element Class

Autodesk.Revit.DB Namespace